app/views/trips/index.html.erb

<table class="table">
<% @trips = Trip.all %>
---
SELECT "trips".* FROM "trips"