app/views/trips/new.html.erb

SELECT "users".* FROM "users"  ORDER BY "users"."name" ASC
---
    <%= form.label :user_id %>
    <%= form.collection_select :user_id, User.order(:name), :id, :name, { include_blank: true }, { class: "form-control" } %>