app/controllers/trips_controller.rb

SELECT "packs".* FROM "packs"
---
	def index
		@trips = Pack.all

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 26]]
---
	def show
		@trip = Trip.find_by(id: params["id"])

INSERT INTO "trips" ("name", "user_id", "city_id", "duration", "season") VALUES (?, ?, ?, ?, ?)  [["name", "jamaica"], ["user_id", 0], ["city_id", 0], ["duration", 10], ["season", "summer"]]
---
  def create
    trip_params = params.require(:trip).permit!
    Trip.create(trip_params)